In [1]:
# this chapter will cover Droping entries  from Dataframes and  series

In [3]:
import numpy as np
import pandas as pd

from pandas import  DataFrame, Series

In [6]:
ser1= Series(np.arange(3),index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int32

In [8]:
# Exampl 1 - Droping index in series
ser1.drop('B')

A    0
C    2
dtype: int32

In [ ]:
# Example 2 - Drop index in DataFrame

In [14]:
dframe1= DataFrame(np.arange(16).reshape(4,4),index= ['SF','LA','NY','MA'], columns=['state1','state2','state3','state4'])
dframe1

    state1  state2  state3  state4
SF       0       1       2       3
LA       4       5       6       7
NY       8       9      10      11
MA      12      13      14      15

In [15]:
#sample - droping a row
dframe1.drop('LA')

    state1  state2  state3  state4
SF       0       1       2       3
NY       8       9      10      11
MA      12      13      14      15

In [17]:
# sample - droping  column

dframe1.drop('state3',axis=1)

    state1  state2  state4
SF       0       1       3
LA       4       5       7
NY       8       9      11
MA      12      13      15